config.org
#+TLE: David's Emacs Configuration
#+STARTUP: hideblocks
#+PROPERTY: header-args :tangle yes

* Initialisation
** Custom file (load custom file)
   #+begin_src emacs-lisp
     (setq custom-file (concat user-emacs-directory "custom.el"))
     (when (file-exists-p custom-file)
       (load custom-file))
   #+end_src

** Packages (init packages repositories)
   Initialize packages and provide the very useful =use-package= function, who installs the package from the repositories if it doesn't exist :ensure t.
   #+begin_src emacs-lisp
     (setq package-archives '(("melpa" . "http://melpa.milkbox.net/packages/")
                              ("org" . "http://orgmode.org/elpa/")
                              ; ("marmalade" . "http://marmalade-repo.org/packages/")
                              ("gnu" . "http://elpa.gnu.org/packages/")))
     (setq package-enable-at-startup nil)

     ;; ZOMG C'ETAIS TELLEMENT FUCKING EASY - RIEN NE MARCHE SANS CE TRUC
     (package-initialize)
   #+end_src
** Util (lisp functions)
   Some cleanup should be done... I'm not sure I use any of these functions.
 #+begin_src emacs-lisp
   (if (fboundp 'with-eval-after-load)
       (defmacro after (feature &rest body)
         "After FEATUR. i. loaded, evaluate BODY."
         (declare (indent defun))
         `(with-eval-after-load ,feature ,@body))
     (defmacro after (feature &rest body)
       "After FEATURE is loaded, evaluate BODY."
       (declare (indent defun))
       `(eval-after-load ,feature
          '(progn ,@body))))


   (defun my-recompile-init ()
     "Byte-compile all your dotfiles again."
     (interactive)
     (byte-recompile-directory (concat user-emacs-directory "config") 0))


   (defun my-window-killer ()
     "closes the window, and deletes the buffer if it's the last window open."
     (interactive)
     (if (> buffer-display-count 1)
         (if (= (length (window-list)) 1)
             (kill-buffer)
           (delete-window))
       (kill-buffer-and-window)))


   (defun my-minibuffer-keyboard-quit ()
     "Abort recursive edit.
   In Delete Selection mode, if the mark is active, just deactivate it;
   then it takes a second \\[keyboard-quit] to abort the minibuffer."
     (interactive)
     (if (and delete-selection-mode transient-mark-mode mark-active)
         (setq deactivate-mark t)
       (when (get-buffer "*Completions*") (delete-windows-on "*Completions*"))
       (abort-recursive-edit)))


   (defun set-transparency (alpha)
     "Sets the transparency of the current frame."
     (interactive "nAlpha: ")
     (set-frame-parameter nil 'alpha alpha))


   (defun my-google ()
     "Google the selected region if any, display a query prompt otherwise."
     (interactive)
     (browse-url
      (concat
       "http://www.google.com/search?ie=utf-8&oe=utf-8&q="
       (url-hexify-string (if mark-active
                              (buffer-substring (region-beginning) (region-end))
                            (read-string "Search Google: "))))))


   (defun my-copy-file-name-to-clipboard ()
     "Copy the current buffer file name to the clipboard."
     (interactive)
     (let ((filename (if (equal major-mode 'dired-mode)
                         default-directory
                       (buffer-file-name))))
       (when filename
         (kill-new filename)
         (message "Copied buffer file name '%s' to the clipboard." filename))))


   (defun my-eval-and-replace ()
     "Replace the preceding sexp with its value."
     (interactive)
     (let ((value (eval (preceding-sexp))))
       (backware-kill-sexp)
       (insert (format "%s" value))))


   (defun my-rename-current-buffer-file ()
     "Renames current buffer and file it is visiting."
     (interactive)
     (let ((filename (buffer-file-name)))
       (if (not (and filename (file-exists-p filename)))
           (message "Buffer is not visiting a file!")
         (let ((new-name (read-file-name "New name: " filename)))
           (cond
            ((vc-backend filename) (vc-rename-file filename new-name))
            (t
             (rename-file filename new-name t)
             (set-visited-file-name new-name t t)))))))


   (defun my-delete-current-buffer-file ()
     "Kill the current buffer and deletes the file it is visiting."
     (interactive)
     (let ((filename (buffer-file-name)))
       (when filename
         (if (vc-backend filename)
             (vc-delete-file filename)
           (when (y-or-n-p (format "Are you sure you want to delete %s? " filename))
             (delete-file filename)
             (message "Deleted file %s" filename)
             (kill-buffer))))))


   (defun my-goto-scratch-buffer ()
     "Create a new scratch buffer."
     (interactive)
     (switch-to-buffer (get-buffer-create "*scratch*"))
     (emacs-lisp-mode))


   (defun my-insert-last-kbd-macro ()
     (interactive)
     (name-last-kbd-macro 'my-last-macro)
     (insert-kbd-macro 'my-last-macro))




#+end_src

** Macro
  #+begin_src emacs-lisp

(add-to-list 'load-path (concat user-emacs-directory "elisp"))
(require 'macro)

;;;;;;;;;;;;;;;;;;;;;;
;; Save Macro Function
;;;;;;;;;;;;;;;;;;;;;;

(defun save-macro (name)
  "save a macro. Take a name as argument
     and save the last defined macro under
     this name at the end of init-macro.el"
  (interactive "SName of the macro :")  ; ask for the name of the macro
  (kmacro-name-last-macro name)         ; use this name for the macro
  (find-file (concat user-emacs-directory "elisp/macro.el"))            ; open ~/.emacs or other user init file
  (goto-char (point-min))               ; go to the end of the .emacs
  (insert-kbd-macro name)               ; copy the macro
  (newline)                             ; insert a newline
  (newline)                             ; insert a newline
  (newline)                             ; insert a newline
  (switch-to-buffer nil))               ; return to the initial buffer
#+end_src

** Hyper key
#+begin_src emacs-lisp
(setq ns-function-modifier 'hyper)  ; make Fn key do Hyper
#+end_src

