config.org
* Elisp functions
#+begin_src emacs-lisp :tangle yes
  (defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))

  (defun unpop-to-mark-command ()
    "Unpop off mark ring. Does nothing if mark ring is empty."
    (interactive)
    (when mark-ring
      (setq mark-ring (cons (copy-marker (mark-marker)) mark-ring))
      (set-marker (mark-marker) (car (last mark-ring)) (current-buffer))
      (when (null (mark t)) (ding))
      (setq mark-ring (nbutlast mark-ring))
      (goto-char (marker-position (car (last mark-ring))))))

  (defun narrow-or-widen-dwim (p)
    "If the buffer is narrowed, it widens. Otherwise, it narrows
     intelligently.  Intelligently means: region, org-src-block,
     org-subtree, or defun, whichever applies first.  Narrowing to
     org-src-block actually calls `org-edit-src-code'.

     With prefix P, don't widen, just narrow even if buffer is already
     narrowed."
    (interactive "P")
    (declare (interactive-only))
    (cond ((and (buffer-narrowed-p) (not p)) (widen))
          ((and (boundp 'org-src-mode) org-src-mode (not p))
           (org-edit-src-exit))
          ((region-active-p)
           (narrow-to-region (region-beginning) (region-end)))
          ((derived-mode-p 'org-mode)
           (cond ((ignore-errors (org-edit-src-code))
                  (delete-other-windows))
                 ((org-at-block-p)
                  (org-narrow-to-block))
                 (t (org-narrow-to-subtree))))
          ((derived-mode-p 'prog-mode) (narrow-to-defun))
          (t (error "Please select a region to narrow to"))))

  (defun db4go-toggle-productivity ()
    (interactive)
    (with-current-buffer (find-file-noselect "/sudo:root@localhost:/etc/hosts")
      (let (beg)
        (goto-char (point-min))
        (search-forward-regexp "^#PRODUCTIVITY")
        (setq beg (point))
        (search-forward-regexp "^#END_PRODUCTIVITY")
        (beginning-of-line)
        (comment-or-uncomment-region beg (point)))
      (save-buffer))
    (message "Productivity toggled"))

  (defun db-read-with-eww ()
    (interactive)
    (let ((temp-file (make-temp-file "epub-to-eww" nil ".html")))
      (write-region nil nil temp-file)
      (eww-open-file temp-file)))

#+end_src
* Plugins
** Ido
#+begin_src emacs-lisp :tangle yes

  (ido-mode t)
  (ido-ubiquitous-mode t)
  (ido-vertical-mode t)
  (setq ido-vertical-define-keys 'C-n-C-p-up-down-left-right)
  (setq ido-auto-merge-work-directories-length -1)

  (setq ido-enable-prefix nil
        ido-enable-flex-matching t
        ido-max-prospects 30)

  (setq ido-ignore-buffers
        '("\\` " "^\*Mess" "^\*Back" ".*Completion" "^\*Ido" "^\*trace"
          "^\*compilation" "^\*GTAGS" "^session\.*" "^\*Compile-Log\*"
          ;; "^\*"
          )
        )

  (require 'flx-ido)
  (ido-everywhere t)
  (flx-ido-mode 1)

  ;; (bind-key "M-x" 'smex)
  ;; (bind-key "M-X" 'smex-major-mode-commands)
  ;;  (bind-key "C-c M-x" 'smex-update)

#+end_src

** Helm
   #+begin_src emacs-lisp

     (require 'helm-config)
     (use-package helm
       :ensure t
       :bind (("C-c x" . helm-M-x)
              ("C-z"   . helm-mini)
              ("C-t"   . helm-imenu)
              ("M-t"   . helm-etags-select)
              ("M-o"   . helm-occur)
              ("C-M-o" . helm-multi-occur)
              ("s-y"   . helm-show-kill-ring)
              ("s-b"   . helm-bookmarks)
              )

       :config
       (customize-set-variable 'helm-boring-buffer-regexp-list
                               (quote
                                ("\\` " "\\*helm" "\\*helm-mode" "\\*Echo Area" "\\*Minibuf" "^\\*")))
       (customize-set-variable 'helm-buffer-max-length 30)
       (customize-set-variable 'helm-candidate-number-limit 100)
       (setq helm-M-x-fuzzy-match t)
       (setq helm-quick-update t)
       (setq helm-bookmark-show-location t)
       (setq helm-buffers-fuzzy-matching t)
       (customize-set-variable 'helm-truncate-lines t)
       )

     (use-package helm-swoop
       :ensure t
       :pin melpa
       :bind ("s-o" . helm-swoop)
       )

     (use-package wgrep-helm
       :ensure t)

     (bind-key "C-M-t" 'projectile-regenerate-tags)

     (use-package helm-ag
       :ensure t
       :config
       (setq helm-ag-thing-at-point 'symbol)
       (customize-set-variable 'helm-ag-base-command "ag")
       (customize-set-variable 'helm-ag-command-option
                               "--nocolor --nogroup --ignore-dir node_modules --ignore-dir elpa")

       (defun helm-ag-projectile ()
         (interactive)
         (if (projectile-project-p)
             (helm-ag (projectile-project-root))
           (helm-ag)))
       (bind-key "s-g" 'helm-ag-projectile)

       (defun helm-ag-do-projectile ()
         (interactive)
         (if (projectile-project-p)
             (helm-do-ag (projectile-project-root))
           (helm-do-ag)))
       (bind-key "s-S-g" 'helm-ag-do-projectile))

     (use-package helm-projectile :ensure t
       :bind (("M-z" . helm-projectile)
              ("s-p" . helm-projectile-switch-project)
              ("s-d" . helm-projectile-find-dir))
       :config
       (customize-set-variable 'helm-projectile-sources-list '(helm-source-projectile-buffers-list
                                                               helm-source-projectile-files-list
                                                               helm-source-projectile-recentf-list)))

     (use-package helm-dash
       :ensure t
       :pin melpa
       :config
       (setq helm-dash-browser-func 'browse-url))


     (use-package helm-spaces
       :ensure t
       :pin melpa
       :commands (helm-spaces)
       :bind ("M-s" . helm-spaces)
       )



#+end_src
