config.el

(use-package helm-c-yasnippet
  :ensure t
  :pin melpa
  :bind (("s-s" . helm-yas-complete-or-create)
         ("s-S" . helm-yas-all-complete-or-create))
  :config

  (defun helm-yas-get-file-by-template (template alist) ;str template
    "Return key"
    (assoc-default template (assoc-default 'template-file-alist alist)))

  (defun helm-yas-get-mode-by-template (template alist) ;str template
    "Return key"
    (file-name-nondirectory
     (directory-file-name
      (file-name-directory (assoc-default template (assoc-default 'template-file-alist alist))))))

  (setq helm-source-yasnippet-create-new-snippet
        '((name . "Create")
          (dummy)
          (action . (("Create" . (lambda (template) (helm-yas-create-new-snippet helm-yas-selected-text)))))))

  (defun helm-yas-complete-or-create ()
    "List of yasnippet snippets using `helm' interface."
    (interactive)
    (helm :sources '(helm-source-yasnippet helm-source-yasnippet-create-new-snippet)))

  (defun helm-yas-all-complete-or-create ()
    "List of yasnippet snippets using `helm' interface."
    (interactive)
    (flet ((yas--get-snippet-tables ()
                                    (let ((tables ()))
                                      (maphash
                                       (lambda (kk vv) (push vv tables))
                                       yas--tables)
                                      tables)))
      (helm :sources '(helm-source-yasnippet helm-source-yasnippet-create-new-snippet))))


  (defun helm-yas-get-transformed-list (alist initial-input)
    "Return list of dotlist, (DISPLAY . REAL) DISPLAY is name of snippet, REAL is template of snippet"

    (let ((initial-input "")
          (transformed-list (assoc-default 'transformed alist 'eq)))

      (cond
       ;; display key on candidate ex: [for] for (...) { ... }
       (helm-yas-display-key-on-candidate
        (setq transformed-list (cl-remove-if-not (lambda (lst)
                                                   (string-match (concat "^" (regexp-quote initial-input)) (car lst)))
                                                 transformed-list))
        (setq transformed-list (cl-loop for dotlst in transformed-list
                                        for name = (car dotlst)
                                        for template = (cdr dotlst)
                                        for key = (helm-yas-get-key-by-template template alist)
                                        for mode = (helm-yas-get-mode-by-template template alist)
                                        for name-inc-key = (format
                                                            "%-20s %-40s %s"
                                                            (propertize key 'face 'helm-yas-key)
                                                            name
                                                            (propertize mode 'face 'helm-buffer-size))
                                        collect `(,name-inc-key . ,template))))

       ;; default ex: for (...) { ... }
       (t
        (setq transformed-list (cl-remove-if-not (lambda (lst)
                                                   (string-match (concat "^" (regexp-quote initial-input)) (car lst)))
                                                 transformed-list))))
      (when helm-yas-not-display-dups
        (setq transformed-list (delete-dups transformed-list)))
      ;; sort
      (setq transformed-list (cl-sort transformed-list 'string< :key 'car))
      transformed-list))

  ;; End of helm-c-yasnippet
  )

(use-package swiper
  :ensure t
  :pin melpa
  :bind ("M-s" . swiper)
  :config
  ;; (bind-key "C-S-s" 'isearch-forward)
  (bind-key "C-w" 'ivy-yank-word swiper-map)
  (bind-key "C-r" 'ivy-previous-line-or-history swiper-map)
  )

(use-package auto-yasnippet
  :ensure t
  :pin melpa
  :commands (aya-create
             aya-expand
             aya-open-line
             aya-persist-snippet)
  :config
  )

(use-package counsel
  :ensure t
  :pin melpa
  :bind ("M-x" . counsel-M-x)
  )

(use-package ivy
  :config
  (ivy-mode t)
  (add-to-list 'ivy-initial-inputs-alist '(counsel-M-x . ""))
  )

(use-package hydra :ensure t)

(defhydra hydra-yasnippet (:color blue :hint nil)
  "
                ^YASnippets^
  --------------------------------------------
    Modes:    Load/Visit:    Actions:

   _g_lobal  _d_irectory    _i_nsert
   _m_inor   _f_ile         _t_ryout
   _e_xtra   _l_ist         _n_ew
           _a_ll
  "
  ("d" yas-load-directory)
  ("e" yas-activate-extra-mode)
  ("i" yas-insert-snippet)
  ("f" yas-visit-snippet-file :color blue)
  ("n" yas-new-snippet)
  ("t" yas-tryout-snippet)
  ("l" yas-describe-tables)
  ("g" yas/global-mode)
  ("m" yas/minor-mode)
  ("a" yas-reload-all))

(defhydra hydra-winner (global-map "C-c")
  "Winner"
  ("<left>" (progn
              (winner-undo)
              (setq this-command 'winner-undo))
   "back")
  ("<right>" winner-redo "forward"))

(defhydra hydra-mark (global-map "C-c")
  "Mark"
  ("," (lambda () (interactive)
         (setq current-prefix-arg '(4)) ; C-u
         (call-interactively 'set-mark-command))
   "Pop mark")
  ("." unpop-to-mark-command "Unpop mark"))

(use-package avy
  :ensure t
  :bind ("M-c" . avy-goto-char-2)
  :config
  (setq avy-keys (number-sequence ?a ?z)))

(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs
        '("~/.emacs.d/snippets"))
  (yas-global-mode 1)

  (bind-keys :map yas-minor-mode-map
             ;; ("<tab>" . nil)
             ;; ("TAB" . nil)
             ("C-<tab>" . yas-expand)
             ("C-c TAB" . yas-insert-snippet ))
  )

(if (fboundp 'global-prettify-symbols-mode)
    (progn
      (global-prettify-symbols-mode)
      (add-hook 'js2-mode-hook
                (lambda ()
                  (push '("function" . 955) prettify-symbols-alist)
                  (push '("return" . 8592) prettify-symbols-alist))))

  (progn
    (use-package pretty-symbols :ensure t :pin melpa)
    (diminish 'pretty-symbols-mode)
    (add-to-list 'pretty-symbol-categories 'js)
    (add-to-list 'pretty-symbol-patterns '(955 js "\\<function\\>" (js2-mode)))
    (add-to-list 'pretty-symbol-patterns '(8592 js "\\<return\\>" (js2-mode)))
    (add-hook 'find-file-hook 'pretty-symbols-mode)))

(use-package indent-guide :ensure t)
