config.org
** Anzu
#+begin_src emacs-lisp :tangle yes
  (use-package anzu
    :ensure t
    :bind (("M-%" . anzu-query-replace)
           ("C-M-%" . anzu-query-replace-regexp))
    :config
    (setq anzu-cons-mode-line-p nil)
    (global-anzu-mode 1))

#+end_src

** Expand Region
#+begin_src emacs-lisp :tangle yes
  (use-package expand-region :ensure t)
#+end_src

** Magit
#+begin_src emacs-lisp :tangle yes
  (use-package magit
    :ensure t
    :bind ("C-x g" . magit-status)
    :config
    (setq magit-last-seen-setup-instructions "1.4.0")

    (bind-key "C-M-1" 'magit-show-level-1-all  magit-diff-mode-map)
    (bind-key "C-M-2" 'magit-show-level-2-all  magit-diff-mode-map)
    (bind-key "C-M-3" 'magit-show-level-3-all  magit-diff-mode-map)
    (bind-key "C-M-4" 'magit-show-level-4-all  magit-diff-mode-map))

#+end_src

** Multiple Cursors
#+begin_src emacs-lisp :tangle yes
  (use-package multiple-cursors :ensure t)
#+end_src

** Iy go to char
#+begin_src emacs-lisp :tangle yes
  (use-package iy-go-to-char :ensure t
    :config (add-to-list 'mc/cursor-specific-vars 'iy-go-to-char-start-pos))

#+end_src

** Projectile
#+begin_src emacs-lisp :tangle yes
  (use-package projectile
    :ensure t
    :config
    (projectile-global-mode t)
    (customize-set-variable 'projectile-globally-ignored-directories
                            '(".idea" ".eunit" ".git" ".hg" ".fslckout" ".bzr" "_darcs" ".tox" ".svn" "build" "node_modules" "elpa"))
    (customize-set-variable 'projectile-remember-window-configs nil)
    (customize-set-variable 'projectile-completion-system 'ivy)
    (customize-set-variable 'projectile-switch-project-action (quote projectile-dired))
    (customize-set-variable 'projectile-tags-command
                            "find . -type f -not -iwholename '*TAGS' -not -size +16k | ctags -f %s %s -e -L -"))
#+end_src
** Company
   #+begin_src emacs-lisp
     (use-package company
       :ensure t
       :pin melpa
       :config
       (setq company-idle-delay 0.3)
       (setq company-minimum-prefix-length 1)
       (setq company-show-numbers 1)
       (setq company-tooltip-limit 10)

       (setq company-dabbrev-downcase nil)
       (setq company-dabbrev-ignore-case nil)

       (setq company-global-modes
             '(not eshell-mode comint-mode org-mode))

       (customize-set-variable 'company-dabbrev-char-regexp "[a-zA-Z0-9-_]")
       (customize-set-variable 'company-selection-wrap-around t)

       (set-face-attribute 'company-tooltip nil :background "black" :foreground "gray40")
       (set-face-attribute 'company-tooltip-selection nil :inherit 'company-tooltip :background "gray15")
       (set-face-attribute 'company-preview nil :background "black")
       (set-face-attribute 'company-preview-common nil :inherit 'company-preview :foreground "gray40")
       (set-face-attribute 'company-scrollbar-bg nil :inherit 'company-tooltip :background "gray20")
       (set-face-attribute 'company-scrollbar-fg nil :background "gray40")

       (when (executable-find "tern")
         (after "company-tern-autoloads"
           (add-to-list 'company-backends 'company-tern)))
       (add-to-list 'company-backends 'company-tern)

       (defun company-auto-completion-toggle ()
         (interactive)
         (if (eq company-idle-delay 0)
             (setq company-idle-delay 0.3)
           (setq company-idle-delay 0))
         (message (format "company-idle-delay : %s" company-idle-delay)))

       (bind-key "C-M-c" 'company-auto-completion-toggle)

       (bind-key "C-o" 'company-manual-begin)
       (bind-key "M-o" 'company-tern)
       (bind-key "M-?" 'company-dabbrev)

       (defadvice company-complete-common (around advice-for-company-complete-common activate)
         (when (null (yas-expand))
           ad-do-it))

       (add-hook 'after-init-hook 'global-company-mode))

#+end_src

** Smartparens
   #+begin_src emacs-lisp

     (use-package smartparens
       :ensure t
       :config

       (setq sp-show-pair-delay 0)
       (setq sp-show-pair-from-inside 1) ;; Shows two pair of parenthesis when used with show-paren-mode

       (setq sp-autoescape-string-quote nil)
       (setq sp-autoinsert-if-followed-by-same 1)
       (setq sp-highlight-pair-overlay nil)

       (sp-use-smartparens-bindings)
       (smartparens-global-mode t)
       (smartparens-global-strict-mode nil)

       (show-smartparens-global-mode t)
       (show-paren-mode 1)

       (sp-pair "`" nil :actions :rem)

       (sp-with-modes sp--lisp-modes
         (sp-local-pair "'" nil :actions nil)
         )

       (define-key sp-keymap (kbd "M-<right>") 'sp-forward-slurp-sexp)
       (define-key sp-keymap (kbd "M-<left>") 'sp-forward-barf-sexp)
       (define-key sp-keymap (kbd "C-<right>") 'nil)
       (define-key sp-keymap (kbd "C-<left>") 'nil)
       ;; (define-key sp-keymap "`" 'nil)
       ;; (define-key sp-keymap 96 'nil)

       ;; (define-key smartparens-strict-mode-map [remap kill-line] 'nil)
       ;; (define-key smartparens-strict-mode-map (kbd "M-k") 'sp-kill-hybrid-sexp)
       (define-key smartparens-strict-mode-map [remap kill-line] 'sp-kill-hybrid-sexp)

       ;; fix conflict where smartparens clobbers yas' key bindings
       (after 'yasnippet
         (defadvice yas-expand (before advice-for-yas-expand activate)
           (sp-remove-active-pair-overlay)))

       (defadvice sp-kill-hybrid-sexp (before kill-line-cleanup-whitespace activate)
         "cleanup whitespace on sp-kill-hybrid-sexp"
         (if (bolp)
             (delete-region (point) (progn (skip-chars-forward " \t") (point)))))

       (customize-set-variable 'sp-hybrid-kill-excessive-whitespace nil)
       (customize-set-variable 'sp-ignore-modes-list (quote (minibuffer-inactive-mode)))
       (customize-set-variable 'sp-show-pair-from-inside t)
       (customize-set-variable 'sp-successive-kill-preserve-whitespace 2)

     )



#+end_src

** Undo-tree
   #+begin_src emacs-lisp :tangle yes
     ;;==========
     ;; Undo tree
     ;;==========

     (use-package undo-tree :ensure t)
     (require 'undo-tree)
     (global-undo-tree-mode)
     ;; Unmap 'C-x r' to avoid conflict with discover
     (after 'undo-tree
       (define-key undo-tree-map (kbd "C-x r") nil))

     (define-key undo-tree-map (kbd "C-/") 'nil)


#+end_src

** Flycheck
   #+begin_src emacs-lisp :tangle yes
(use-package flycheck :ensure t)
(add-hook 'after-init-hook #'global-flycheck-mode)

(customize-set-variable 'flycheck-disabled-checkers (quote (emacs-lisp-checkdoc)))
(customize-set-variable 'flycheck-idle-change-delay 0.5)

#+end_src

** Diminish
   #+begin_src emacs-lisp :tangle yes
;; For a cleaner modeline
(use-package diminish :ensure t)
(diminish 'visual-line-mode)
(after 'autopair (diminish 'autopair-mode))
(after 'js2 (diminish 'Javascript-IDE))
(after 'js2r (diminish 'js2r-mode))
(after 'skewer (diminish 'skewer-mode))
(after 'undo-tree (diminish 'undo-tree-mode))
(after 'auto-complete (diminish 'auto-complete-mode))
;(after 'projectile (diminish 'projectile-mode))
(after 'yasnippet (diminish 'yas-minor-mode))
(after 'guide-key (diminish 'guide-key-mode))
(after 'eldoc (diminish 'eldoc-mode))
(after 'smartparens (diminish 'smartparens-mode))
(after 'elisp-slime-nav (diminish 'elisp-slime-nav-mode))
(after 'git-gutter+ (diminish 'git-gutter+-mode))
;; (after 'helm (diminish 'helm-mode))
(after 'anzu (diminish 'anzu-mode))
(after 'skewer (diminish 'skewer-mode))
(after 'tern (diminish 'tern-mode))
;; (after 'company (diminish 'company-mode))
#+end_src

** Tramp
#+begin_src emacs-lisp :tangle yes
   (require 'tramp)
   (setq tramp-backup-directory-alist `(("." . "~/.saves_tramp")))
  (setq tramp-default-method "sshx")

(setq password-cache-expiry 'nil)

   ;; (add-to-list 'backup-directory-alist
   ;;              (cons tramp-file-name-regexp nil))
#+end_src

** Neotree
#+begin_src emacs-lisp :tangle yes
  (use-package neotree
    :bind ("M-`" . neotree-toggle)
    :config
    (setq neo-smart-open t)
    ; (setq projectile-switch-project-action 'neotree-projectile-action)
  )
#+end_src
** Ag
#+begin_src emacs-lisp :tangle yes
    (when (executable-find "ag")
      (use-package ag :ensure t)
      (setq ag-highlight-search t)
      (use-package wgrep-ag) :ensure t)
(customize-set-variable 'ag-arguments
   (quote
    ("--smart-case" "--nogroup" "--column" "--ignore-dir" "node_modules" "--ignore-dir" "elpa")))
(customize-set-variable 'ag-highlight-search t)
#+end_src

** Shackles
#+begin_src emacs-lisp :tangle yes
  (use-package shackle
    :ensure t
    :pin melpa
    :config
    (setq shackle-rules '(("\\`\\*[hH]elm.*?\\*\\'" :regexp t :align t :ratio 0.4)))
    (shackle-mode t)
    )
#+end_src
