config.org
** COMMENT Workspace
   #+begin_src emacs-lisp
(use-package workgroups2 :ensure t)
(require 'workgroups2)

;; if you start Emacs as "emacs --daemon" - turn off autoloading of workgroups:
;; (setq wg-use-default-session-file nil)


;; Change workgroups session file
(setq wg-default-session-file "~/.emacs.d/.emacs_workgroups")

;; winner-mode to undo/redo windows changes
(when (fboundp 'winner-mode)
  (winner-mode 1))

;;Winner-mode per workgroup hack
(defvar wg-winner-vars nil)
(defvar wg-winner-hash nil)

(setq wg-winner-vars '(winner-ring-alist
               winner-currents
               winner-point-alist
               winner-undone-data
               winner-undo-counter
               winner-pending-undo-ring))

(setq wg-winner-hash (make-hash-table :test 'equal))

(defun wg-winner-put (winner-name)
  (let ((wg (ignore-errors (wg-workgroup-name (wg-current-workgroup)))))
    (if wg
    (puthash (list wg winner-name) (eval winner-name) wg-winner-hash))))

(defun wg-winner-get (winner-name)
  (let ((wg (ignore-errors (wg-workgroup-name (wg-current-workgroup)))))
    (if wg
    (eval `(setq ,winner-name (gethash '(,wg ,winner-name) wg-winner-hash))))))

(defun wg-winner-save ()
  (if winner-mode
      (progn
    (winner-mode -1)
    (defun wg-winner-mode-restore ()
      (winner-mode 1)))
    (defun wg-winner-mode-restore ()))
  (mapcar 'wg-winner-put wg-winner-vars))

(defun wg-winner-load ()
  (mapcar 'wg-winner-get wg-winner-vars)
  (wg-winner-mode-restore))

(defadvice wg-switch-to-workgroup (before wg-winner-before activate)
  (wg-winner-save))

(defadvice wg-switch-to-workgroup (after wg-winner-after activate)
  (wg-winner-load))


;     (discover-add-context-menu
;      :context-menu '(workgroups2
;                      (description "workgroups2")
;                      (actions
;                       ("Windows configuration"
;                        ("w" "Save window configuration" wg-save-wconfig)
;                        ("j" "Jump to window configuration" wg-restore-saved-wconfig)
;                        ("k" "Kill window configuration" wg-kill-saved-wconfig)
;                        ("]" "Redo wconfig change" wg-redo-wconfig-change)
;                        ("[" "Undo wconfig change" wg-undo-wconfig-change)
;                        )
;                       ("Workgroups"
;                        ("M-e" "Switch to workgroup" wg-switch-to-workgroup)
;                        ("e" "Switch to workgroup" wg-switch-to-workgroup)
;                        ("/" "Switch to last workgroup" wg-switch-to-previous-workgroup)
;                        ("r" "Rename" wg-rename-workgroup)
;                        ("c" "Create" wg-create-workgroup)
;                        ("C" "Clone" wg-clone-workgroup)
;                        ("C-k" "Kill Workgroup" wg-kill-workgroup)
;                        ("s" "Save session" wg-save-session)
;                        ("C-l" "Load session" wg-reload-session)
;                        )
;                       ))
;      :bind "<f1>")

; (workgroups-mode 1)   ; put this one at the bottom of .emacs

#+end_src

** COMMENT Guru-mode
   #+begin_src emacs-lisp :tangle yes
;; (use-package guru-mode :ensure t)
;; (require 'guru-mode)
;; (guru-global-mode 1)
#+end_src

** COMMENT God-mode
   #+begin_src emacs-lisp :tangle yes
(defun my-update-cursor ()
  (setq cursor-type (if (or god-local-mode buffer-read-only)
                        'bar
                      'box)))

(add-hook 'god-mode-enabled-hook 'my-update-cursor)
(add-hook 'god-mode-disabled-hook 'my-update-cursor)

(bind-key "<escape>" 'god-mode-all)
(after 'god-mode
  (define-key god-local-mode-map (kbd "i") 'god-mode)
  (define-key god-local-mode-map (kbd "<right>")	'windmove-right)
  (define-key god-local-mode-map (kbd "<left>")	'windmove-left)
  (define-key god-local-mode-map (kbd "<down>")	'windmove-down)
  (define-key god-local-mode-map (kbd "<up>")	'windmove-up))

#+end_src

** COMMENT Elscreen
   #+begin_src emacs-lisp :tangle yes
(elscreen-start)

;; Elscreen
(elscreen-set-prefix-key "\M-e")  ;; kbd
  (define-key elscreen-map (kbd  "t"             )  'elscreen-toggle-display-tab)
  (define-key elscreen-map (kbd  "<right>"       )  'elscreen-next)
  (define-key elscreen-map (kbd  "<left>"                )  'elscreen-previous)
  (define-key elscreen-map (kbd  "C-<right>"     )  'elscreen-next)
  (define-key elscreen-map (kbd  "C-<left>"      )  'elscreen-previous)
  (define-key elscreen-map (kbd  "r"             )  'elscreen-screen-nickname)
  (define-key elscreen-map (kbd  "c"             )  'elscreen-create)
  (define-key elscreen-map (kbd  "k"             )  'elscreen-kill)
  (define-key elscreen-map (kbd  "s"             )  'elscreen-swap)
  (define-key elscreen-map (kbd  "t"             )  'elscreen-toggle-display-tab)
  (define-key elscreen-map (kbd  "<right>"       )  'elscreen-next)
  (define-key elscreen-map (kbd  "<left>"                )  'elscreen-previous)
  (define-key elscreen-map (kbd  "C-<right>"     )  'elscreen-next)
  (define-key elscreen-map (kbd  "C-<left>"      )  'elscreen-previous)

#+end_src

** COMMENT Git Gutter
#+begin_src emacs-lisp :tangle yes
  (use-package git-gutter
    :ensure t
    :config
    (global-git-gutter-mode t))
#+end_src
* Languages modes
** scala
#+begin_src emacs-lisp :tangle yes
  (use-package scala-mode2
    :ensure t)

  (use-package ensime
    :ensure t)

#+end_src
** c
   #+begin_src emacs-lisp
     (defun count-lines-function ()
       "count number of lines and characters beetwen matched parenthesis"
       (interactive)
       (forward-char 1)
       (save-excursion
         (set-mark-command nil)
         (let
             ((start (progn (c-beginning-of-defun) (point)))
              (end (progn (c-end-of-defun) (previous-line 3)
                          (forward-char 1) (forward-char -1)
                          (point))))
           (count-lines-region start end)))
       (forward-char -1))
     ;;  Ligne ubercool
     (save-excursion (let ((start (point)) (end (progn (forward-list) (point)))) (count-lines-region start end)))

     ;; Add count-lines-function to c-mode
     (defun my-c-mode-hook ()
       (local-set-key (kbd "C-c C-w") 'count-lines-function)
       )
     (add-hook 'c-mode-hook 'my-c-mode-hook)

   #+end_src

** coffeescript
   #+begin_src emacs-lisp
     (eval-after-load "coffee-mode"
       '(progn
          (define-key coffee-mode-map [(meta r)] 'coffee-compile-buffer)
          (define-key coffee-mode-map (kbd "C-j") 'coffee-newline-and-indent
            (setq coffee-args-compile (quote ("-c" "--bare"))))
          (setq coffee-tab-width 4)))
   #+end_src

** jade
   #+begin_src emacs-lisp
     (require 'sws-mode)
     (add-to-list 'auto-mode-alist '("\\.styl$" . sws-mode))

     (require 'jade-mode)
     (add-to-list 'auto-mode-alist '("\\.jade$" . jade-mode))


     (add-hook 'jade-mode-hook 'enable-indent-guide)
     (defun enable-indent-guide ()
       "Enable indent guide mode"
       (indent-guide-mode t))


     (add-hook 'jade-mode-hook '(lambda () (interactive) (yas-minor-mode -1)))
     (add-hook 'jade-mode-hook '(lambda () (interactive) (smartparens-strict-mode -1)))


     ;; First create new face which is a copy of hl-line-face
     (copy-face 'font-lock-type-face 'font-lock-type-face-jade-mode)

     ;; Change what you want in this new face
     (set-face-attribute 'font-lock-type-face-jade-mode
                         '(:foreground "blue" :weight normal))

     ;; The function to use the new face
     (defun my-jade-type-face ()
       (set (make-local-variable 'font-lock-type-face) ; This is how to make it local
            'font-lock-type-face-jade-mode))

     ;; Finally, the hook
     (add-hook 'jade-mode-hook 'my-jade-type-face)
#+end_src

** Org
*** Setup
    #+begin_src emacs-lisp

      (use-package org
        :config
        (bind-key "<f2>" 'org-edit-special org-mode-map)
        (bind-key "<f2>" 'org-edit-src-exit org-src-mode-map)
        (bind-key "\C-cl" 'org-store-link)
        (bind-key "\C-ca" 'org-agenda))

      (setq org-log-done t)

      (setq org-tag-alist nil)

      ;; (bind-key "<C-S-right>" 'helm-occur)

      (eval-after-load "org"
        '(progn
           (define-key org-mode-map (kbd "<C-S-up>") 'outline-up-heading)
           (define-key org-mode-map (kbd "<C-S-up>") 'outline-up-heading)
           ;; (define-key org-mode-map (kbd "<C-S-right>") 'nil)
           ;; (define-key org-mode-map (kbd "<C-left>") nil)
           ;; (define-key org-mode-map (kbd "<C-right>") nil)
           (define-key org-mode-map (kbd "M-<down>") 'nil)
           (define-key org-mode-map (kbd "M-<up>") 'nil)))

      (setq org-src-fontify-natively t)
      (setq org-src-tab-acts-natively t)

      (customize-set-variable 'org-export-backends (quote (ascii html icalendar latex md)))

      (setq org-main-file "~/org/notes.org")
      (setq org-directory "~/org")

      (defun org-insert-elisp-block (name beg end)
        (interactive "sName:\nr")
        (org-insert-heading-after-current)
        (save-excursion
          (insert name "\n")
          (insert "#+begin_src emacs-lisp :tangle yes" "\n")
          (if (region-active-p)
              (progn
                (kill-region beg end)
                (yank)))
          (insert "#+end_src")))

      (define-key org-mode-map (kbd "M-<return>") 'org-insert-elisp-block)


    #+end_src

*** Org agenda
    Main org file which will be added to the agenda and where notes will be captured (using C-c c).
    #+begin_src emacs-lisp :tangle yes
      (setq org-agenda-files '("~/org"))
(load-library "find-lisp")
(setq org-agenda-files (find-lisp-find-files org-directory "\.org$"))

      ;; (setq org-agenda-files (list org-main-file))
#+end_src

