config.el

(use-package scala-mode2
  :ensure t)

(use-package ensime
  :ensure t)

(defun count-lines-function ()
  "count number of lines and characters beetwen matched parenthesis"
  (interactive)
  (forward-char 1)
  (save-excursion
    (set-mark-command nil)
    (let
        ((start (progn (c-beginning-of-defun) (point)))
         (end (progn (c-end-of-defun) (previous-line 3)
                     (forward-char 1) (forward-char -1)
                     (point))))
      (count-lines-region start end)))
  (forward-char -1))
;;  Ligne ubercool
(save-excursion (let ((start (point)) (end (progn (forward-list) (point)))) (count-lines-region start end)))

;; Add count-lines-function to c-mode
(defun my-c-mode-hook ()
  (local-set-key (kbd "C-c C-w") 'count-lines-function)
  )
(add-hook 'c-mode-hook 'my-c-mode-hook)

(eval-after-load "coffee-mode"
  '(progn
     (define-key coffee-mode-map [(meta r)] 'coffee-compile-buffer)
     (define-key coffee-mode-map (kbd "C-j") 'coffee-newline-and-indent
       (setq coffee-args-compile (quote ("-c" "--bare"))))
     (setq coffee-tab-width 4)))

(require 'sws-mode)
(add-to-list 'auto-mode-alist '("\\.styl$" . sws-mode))

(require 'jade-mode)
(add-to-list 'auto-mode-alist '("\\.jade$" . jade-mode))


(add-hook 'jade-mode-hook 'enable-indent-guide)
(defun enable-indent-guide ()
  "Enable indent guide mode"
  (indent-guide-mode t))


(add-hook 'jade-mode-hook '(lambda () (interactive) (yas-minor-mode -1)))
(add-hook 'jade-mode-hook '(lambda () (interactive) (smartparens-strict-mode -1)))


;; First create new face which is a copy of hl-line-face
(copy-face 'font-lock-type-face 'font-lock-type-face-jade-mode)

;; Change what you want in this new face
(set-face-attribute 'font-lock-type-face-jade-mode
                    '(:foreground "blue" :weight normal))

;; The function to use the new face
(defun my-jade-type-face ()
  (set (make-local-variable 'font-lock-type-face) ; This is how to make it local
       'font-lock-type-face-jade-mode))

;; Finally, the hook
(add-hook 'jade-mode-hook 'my-jade-type-face)

(use-package org
  :config
  (bind-key "<f2>" 'org-edit-special org-mode-map)
  (bind-key "<f2>" 'org-edit-src-exit org-src-mode-map)
  (bind-key "\C-cl" 'org-store-link)
  (bind-key "\C-ca" 'org-agenda))

(setq org-log-done t)

(setq org-tag-alist nil)

;; (bind-key "<C-S-right>" 'helm-occur)

(eval-after-load "org"
  '(progn
     (define-key org-mode-map (kbd "<C-S-up>") 'outline-up-heading)
     (define-key org-mode-map (kbd "<C-S-up>") 'outline-up-heading)
     ;; (define-key org-mode-map (kbd "<C-S-right>") 'nil)
     ;; (define-key org-mode-map (kbd "<C-left>") nil)
     ;; (define-key org-mode-map (kbd "<C-right>") nil)
     (define-key org-mode-map (kbd "M-<down>") 'nil)
     (define-key org-mode-map (kbd "M-<up>") 'nil)))

(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)

(customize-set-variable 'org-export-backends (quote (ascii html icalendar latex md)))

(setq org-main-file "~/org/notes.org")
(setq org-directory "~/org")

(defun org-insert-elisp-block (name beg end)
  (interactive "sName:\nr")
  (org-insert-heading-after-current)
  (save-excursion
    (insert name "\n")
    (insert "#+begin_src emacs-lisp :tangle yes" "\n")
    (if (region-active-p)
        (progn
          (kill-region beg end)
          (yank)))
    (insert "#+end_src")))

(define-key org-mode-map (kbd "M-<return>") 'org-insert-elisp-block)

(setq org-agenda-files '("~/org"))
(load-library "find-lisp")
(setq org-agenda-files (find-lisp-find-files org-directory "\.org$"))

      ;; (setq org-agenda-files (list org-main-file))
