config.org
*** Org capture
    #+begin_src emacs-lisp :tangle yes
      (setq org-default-notes-file org-main-file)
      (define-key global-map (kbd "C-c c") 'org-capture)
      (define-key global-map (kbd "s-t") 'org-capture)
      ;;(define-key global-map (kbd "<f1>") 'org-capture)
      (define-key global-map (kbd "<S-f1>") (lambda () (interactive)
                                              (let ((current-prefix-arg '(4)))
                                                (call-interactively 'org-capture))))

      (defun llc-get-project-org-name ()
        "Return the name of the projectile project"
        (replace-regexp-in-string "[^[:alnum:]]" "-"
                                  (car (last (split-string (projectile-project-root) "/" t)))))

      (defun llc-get-project-org-file ()
        "Return the path to the project org file"
        (concat org-directory "/projects/"
                (llc-get-project-org-name)
                ".org"))

      (defun llc-find-project-org-file-task ()
        "Find the org file associated with the current projectile project, creating it if needed, and place the point at the end of 'Tasks' subtree."
        (let ((project-file (llc-get-project-org-file))
              (project-headline-regexp "^\\* Tasks")
              (project-name (llc-get-project-org-name)))
          (set-buffer (find-file-noselect project-file))
          (goto-char (point-min))
          (if (not (re-search-forward project-headline-regexp nil t))
              (progn
                (goto-char (point-max))
                (if (not (eq (buffer-size) 0))
                    (newline 2))
                (insert (concat "* Tasks :project:" project-name ":"))))
          (goto-char (point-min))
          (re-search-forward project-headline-regexp)
          (end-of-line)))

      ;; (setq org-capture-templates
      ;;       '(("p" "Project" entry (function llc-find-project-org-file-task)
      ;;          "* TODO %?\n  %a\n  %i")
      ;;         ("t" "Todo" entry (file+headline "~/org/notes.org" "Todo")
      ;;          "* TODO %?\n  %a\n  %i")
      ;;         ("n" "Note" entry (file+headline "~/org/notes.org" "Notes")
      ;;          "* %?\n  %a\n  %i")
      ;;         ("j" "Journal" entry (file+datetree "~/org/journal.org")
      ;;          "* %?\nEntered on %U\n  %a\n  %i")
      ;;         ("J" "Journal - more options")
      ;;         ("Jc" "Journal Clipboard" entry (file+datetree "~/org/journal.org")
      ;;          "* %?\nEntered on %U\n  %x\n  %a")))


      (setq org-capture-templates
            '(("t" "Todo" entry (file+headline "~/org/todo.org" "Todo")
               "* TODO %?\n  %a\n  %i")
              ("w" "Todo - Work" entry (file+headline "~/org/todo.org" "Work")
               "* TODO %?\n  %a\n  %i")
              ("c" "Todo - Clipboard" entry (file+headline "~/org/todo.org" "Todo")
               "* TODO %?\n  %c\n  %i")
              ("j" "Journal" entry (file+datetree "~/org/journal.org")
               "* %?\nEntered on %U\n  %a\n  %i")
              ("J" "Journal - more options")
              ("Jc" "Journal Clipboard" entry (file+datetree "~/org/journal.org")
               "* %?\nEntered on %U\n  %x\n  %a")))

      (setq org-capture-templates-contexts
            '(("p" ((lambda () "DOCSTRING" (interactive) (projectile-project-root))))))

      ;; Close frame after org-capture only if a certain frame-parameter is set
      (defun llc-close-frame-after-org-capture ()
        (if (frame-parameter nil 'llc-close-frame-after-org-capture)
            (delete-frame)))
      (add-hook 'org-capture-after-finalize-hook 'llc-close-frame-after-org-capture)

    #+end_src

*** COMMENT org-bullets
    #+begin_src emacs-lisp :tangle yes
(use-package org-bullets :ensure t)
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** javascript
   #+begin_src emacs-lisp
     (use-package js2-mode
       :mode "\\.js\\'"
       :config
       (customize-set-variable 'js2-bounce-indent-p nil)
       (customize-set-variable 'js2-global-externs [global require])
       (customize-set-variable 'js2-include-node-externs t)
       (customize-set-variable 'js2-basic-offset 2)
       (customize-set-variable 'js2-mode-show-parse-errors nil)
       (customize-set-variable 'js2-mode-show-strict-warnings nil)

       (add-hook 'js2-mode-hook (lambda () (setq indent-tabs-mode 'nil)))
       (add-hook 'js2-mode-hook #'hs-minor-mode)
       (add-hook 'js2-mode-hook #'eldoc-mode)
       (add-hook 'js2-mode-hook #'subword-mode)

       (use-package js2-refactor
         :config
         ;; eg. extract function with `C-c C-m ef`.
         (js2r-add-keybindings-with-prefix "C-c C-m")
         (add-hook 'js2-mode-hook #'js2-refactor-mode)
         )

       (use-package tern
         :ensure t
         :if (executable-find "tern")
         :config
         (add-hook 'js2-mode-hook 'tern-mode)
         (use-package company-tern :ensure t)
         )

     )

     ;; SLIME - SWANK-JS
     ;; (require 'slime)
     ;; (autoload 'slime "slime" "Slime" t)

     ;; (ignore-errors
     ;;   (slime-setup '(slime-js2 slime-repl))
     ;;   (add-hook 'js2-mode-hook
     ;;             (lambda ()
     ;;               (slime-js-minor-mode 1)))
     ;;   (add-hook 'css-mode-hook
     ;;             (lambda ()
     ;;               (define-key css-mode-map "\M-\C-x" 'slime-js-refresh-css)
     ;;               (define-key css-mode-map "\C-c\C-r" 'slime-js-embed-css))))


     ;;SWANK-JS MODE IS FUCKING AWESOME
     ;; (bind-key [f5] 'slime-js-reload)

     ;; ;; SKEWER
     ;; (add-hook 'js2-mode-hook 'skewer-mode)
     ;; (add-hook 'css-mode-hook 'skewer-css-mode)
     ;; (add-hook 'html-mode-hook 'skewer-html-mode)

     ;; TERN
     ;; (add-hook 'js2-mode-hook (lambda () (tern-mode t)))
     ;; (add-hook 'js2-mode-hook (lambda () (tern-mode t)))
     ;; (eval-after-load 'tern
     ;;   '(progn
     ;;      (require 'tern-auto-complete)
     ;;      ;; (tern-ac-setup)
     ;;      (define-key tern-mode-keymap (kbd "C-o") 'tern-ac-complete)
     ;;      ))


   #+end_src

** livescript
   #+begin_src emacs-lisp
(load "~/.emacs.d/vendor/livescript-mode.el")

;; Javascript improved mode js2-mode
(add-to-list 'auto-mode-alist '("\\.ls\\'" . livescript-mode))

(defun livescript-eval ()
  (local-set-key (kbd "C-x C-e") 'livescript-compile-region))
(add-hook 'livescript-mode-hook 'livescript-eval)




#+end_src

** lua
   #+begin_src emacs-lisp

(setq auto-mode-alist (cons '("\.lua$" . lua-mode) auto-mode-alist))
(autoload 'lua-mode "lua-mode" "Lua editing mode." t)



#+end_src

** php
   #+begin_src emacs-lisp

     (autoload 'php-mode "php-mode.el" "Php mode." t)
     (setq auto-mode-alist (append '(("/*.\.php[345]?$" . php-mode)) auto-mode-alist))

   #+end_src

** python
   #+begin_src emacs-lisp
     ;; (require 'elpy nil t)

     (elpy-enable)
     (elpy-use-ipython "ipython3")
     ;; (elpy-clean-modeline)

     (defun elpy-use-python3 (args)
       (elpy-use-ipython "ipython3")
       (interactive "P")
       )

     (setq elpy-rpc-backend "jedi")

     ;; (add-hook 'python-mode-hook 'jedi:setup)
     ;; (setq jedi:complete-on-dot t)                ; optional

     ;; Ignoring electric indentation
     (defun electric-indent-ignore-python (char)
       "Ignore electric indentation for python-mode"
       (if (equal major-mode 'python-mode)
           `no-indent'
         nil))
     (add-hook 'electric-indent-functions 'electric-indent-ignore-python)

     (define-key elpy-mode-map (kbd "<C-down>") 'nil)
     (define-key elpy-mode-map (kbd "<C-up>") 'nil)
     (define-key elpy-mode-map (kbd "<M-up>") 'nil)
     (define-key elpy-mode-map (kbd "<M-down>") 'nil)

     ;; Fix yasnippet indentation in python-mode
     (add-hook 'python-mode-hook
        '(lambda () (set (make-local-variable 'yas-indent-line) 'fixed)
           (company-mode -1)))
   #+end_src

** web
   #+begin_src emacs-lisp
     (use-package web-mode
       :mode (("\\.phtml\\'" . web-mode)
              ("\\.tpl\\.php\\'" . web-mode)
              ("\\.[gj]sp\\'" . web-mode)
              ("\\.as[cp]x\\'" . web-mode)
              ("\\.erb\\'" . web-mode)
              ("\\.mustache\\'" . web-mode)
              ("\\.djhtml\\'" . web-mode)
              ("\\.html?\\'" . web-mode)
              ("\\.dust?\\'" . web-mode))

       :init
       
       :config
       (defun my-web-mode-hook ()
         "Hooks for Web mode."
         (setq web-mode-markup-indent-offset 2)
         )
       (add-hook 'web-mode-hook  'my-web-mode-hook)
       )



   #+end_src

* Core
