config.org
** Misc
#+begin_src emacs-lisp
  (setq scroll-margin 5)

  (bind-key "C--" 'hs-hide-block hs-minor-mode-map)
  (bind-key "C-=" 'hs-show-block hs-minor-mode-map)
  (bind-key "M--" 'hs-hide-all hs-minor-mode-map)
  (bind-key "M-=" 'hs-show-all hs-minor-mode-map)
  (bind-key "s-h" 'hs-toggle-hiding hs-minor-mode-map)


  (defun hs-hide-global-level (level)
    (interactive)
    (save-excursion
      (goto-char (point-max))
      (hs-hide-level level)))

  (bind-key "M-s-1" (lambda () (interactive) (hs-hide-global-level 1)))
  (bind-key "M-s-2" (lambda () (interactive) (hs-hide-global-level 2)))
  (bind-key "M-s-3" (lambda () (interactive) (hs-hide-global-level 3)))
  (bind-key "M-s-4" (lambda () (interactive) (hs-hide-global-level 4)))
  (bind-key "M-s-5" (lambda () (interactive) (hs-hide-global-level 5)))
  (bind-key "M-s-6" (lambda () (interactive) (hs-hide-global-level 6)))

  ;; (bind-key "s-h" 'mark-paragraph)

  (setq search-whitespace-regexp ".*?")

  (setq eldoc-idle-delay 0)

  (setq dired-dwim-target t)

  (customize-set-variable 'winner-dont-bind-my-keys t)
  (winner-mode 1)

  (setq mac-command-modifier 'super)
  (setq mac-option-modifier 'meta)

                                          ; Show full path in title
  (setq-default frame-title-format "%f")
  (setq ring-bell-function 'ignore)

  (setq indent-tabs-mode 'nil)

  (setq save-interprogram-paste-before-kill t)

  (setq bookmark-saved-flag 1)

  (setq suggest-key-binding 5)

  (window-numbering-mode t)

  (setq help-window-select t)

  (customize-set-variable 'scroll-bar-mode (quote right))
  (customize-set-variable 'scroll-conservatively 100000)
  (customize-set-variable 'scroll-preserve-screen-position 1)

  (customize-set-variable 'show-paren-delay 0)
  (customize-set-variable 'show-paren-mode t)
  (customize-set-variable 'smex-history-length 1000)
  (customize-set-variable 'recentf-auto-cleanup (quote never))
  (customize-set-variable 'recentf-max-saved-items 200000)

  (setq inhibit-startup-screen t)

  (setq reb-re-syntax 'string) ;; fix backslash madness
  (add-hook 'reb-mode-hook (lambda () (smartparens-strict-mode -1)))

  (global-auto-revert-mode 1)
  (electric-indent-mode -1)
  (transient-mark-mode 1)
  (delete-selection-mode -1)

  ;; Enable access to the clipboard
  (setq x-select-enable-clipboard t)

  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Try to fix the shell unicode problem
  (defadvice ansi-term (after advise-ansi-term-coding-system)
    (set-buffer-process-coding-system 'utf-8-unix 'utf-8-unix))
  (ad-activate 'ansi-term)

  (put 'narrow-to-region 'disabled nil)

  (require 'recentf)
  ;; (recentf-mode 1)
  (setq recentf-max-menu-items 10)
  ;; (bind-key "\C-x\ \C-r" 'recentf-open-files)

  (require 'uniquify)
  (customize-set-variable 'uniquify-buffer-name-style 'post-forward-angle-brackets)
  (customize-set-variable 'uniquify-strip-common-suffix t)

  ;; (setq uniquify-buffer-name-style 'reverse)

  ;;todo

  (defun my-find-file-check-make-large-file-read-only-hook ()
    "If a file is over a given size, make the buffer read only."
    (when (> (buffer-size) (* 1024 1024))
      (setq buffer-read-only t)
      (buffer-disable-undo)
      (fundamental-mode)))
  (add-hook 'find-file-hooks 'my-find-file-check-make-large-file-read-only-hook)

                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Add prefix to Dired buffers
                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (add-hook 'dired-mode-hook 'ensure-buffer-name-ends-in-slash)
  (defun ensure-buffer-name-ends-in-slash ()
    "change buffer name to end with slash"
    (let ((name (buffer-name)))
      (if (not (string-match "^Dir/" name))
          (rename-buffer (concat "Dir/" name) t))))

                                        ;;;;;;;;;;;;;;;;;;;
  ;; Eval and replace
                                        ;;;;;;;;;;;;;;;;;;;

  (defun eval-and-replace ()
    "Replace the preceding sexp with its value."
    (interactive)
    (backward-kill-sexp)
    (condition-case nil
        (prin1 (eval (read (current-kill 0)))
               (current-buffer))
      (error (message "Invalid expression")
             (insert (current-kill 0)))))

                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Emacs Backfup Files settings (those damn annoying ~ files !)
                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (setq backup-directory-alist `(("." . "~/.saves")))
  (setq backup-by-copying t)
  (setq delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t)

  (setq auto-save-file-name-transforms
        `((".*" ,"~/.saves/" t)))

  ;; remove those pesky lock files
  (setq create-lockfiles nil)

                                        ;;;;;;;;;;;;;;;;;;;;;;
  ;; Mouse/Wheel options
                                        ;;;;;;;;;;;;;;;;;;;;;;

  (defun up-and-locate()
    (interactive)
    (scroll-down 8)
    )

  (defun down-and-locate()
    (interactive)
    (scroll-down -8)
    )

  (defun mouse-up-and-locate()
    (interactive)
    (scroll-down 3)
    )

  (defun mouse-down-and-locate()
    (interactive)
    (scroll-down -3)
    )


                                        ;;;;;;;;;;;;;;;;;;;;;;
  ;; Indent Whole Buffer
                                        ;;;;;;;;;;;;;;;;;;;;;;

  (defun indent-whole-buffer ()
    "indent whole buffer and untabify it"
    (interactive)
    (delete-trailing-whitespace)
    (indent-region (point-min) (point-max) nil))

  ;;todo
                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; FIX FOR TERMINAL SHIFT+UP
                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (if (equal "xterm" (tty-type))
      (define-key input-decode-map "\e[1;2A" [S-up]))

  (defadvice terminal-init-xterm (after select-shift-up activate)
    (define-key input-decode-map "\e[1;2A" [S-up]))

                                        ;;;;;;;;;;;;;;;;;;;;;
  ;; Locked buffer mode
                                        ;;;;;;;;;;;;;;;;;;;;;

  (define-minor-mode locked-buffer-mode
    "Make the current window always display this buffer."
    nil " locked" nil
    (set-window-dedicated-p (selected-window) locked-buffer-mode))


                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Save undo history when revert-buffer
                                        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; emacs doesn't actually save undo history with revert-buffer
  ;; see http://lists.gnu.org/archive/html/bug-gnu-emacs/2011-04/msg00151.html
  ;; fix that.
  (defun revert-buffer-keep-history (&optional IGNORE-AUTO NOCONFIRM PRESERVE-MODES)
    (interactive)

    ;; tell Emacs the modtime is fine, so we can edit the buffer
    (clear-visited-file-modtime)

    ;; insert the current contents of the file on disk
    (widen)
    (delete-region (point-min) (point-max))
    (insert-file-contents (buffer-file-name))

    ;; mark the buffer as not modified
    (not-modified)
    (set-visited-file-modtime))

  (setq revert-buffer-function 'revert-buffer-keep-history)
  (add-hook 'after-revert-hook  (lambda ()   (font-lock-fontify-buffer)))


                                        ;;;;;;;;;;;;;;;;;
  ;; Search engines
                                        ;;;;;;;;;;;;;;;;;

  (defun prelude-search (query-url prompt)
    "Open the search url constructed with the QUERY-URL.
                                        PROMPT sets the `read-string prompt."
    (browse-url
     (concat query-url
             (url-hexify-string
              (if mark-active
                  (buffer-substring (region-beginning) (region-end))
                (read-string prompt))))))

  (defmacro prelude-install-search-engine (search-engine-name search-engine-url search-engine-prompt)
    "Given some information regarding a search engine, install the interactive command to search through them"
    `(defun ,(intern (format "prelude-%s" search-engine-name)) ()
       ,(format "Search %s with a query or region if any." search-engine-name)
       (interactive)
       (prelude-search ,search-engine-url ,search-engine-prompt)))

  (prelude-install-search-engine "google"     "http://www.google.com/search?q="              "Google: ")
  (prelude-install-search-engine "youtube"    "http://www.youtube.com/results?search_query=" "Search YouTube: ")
  (prelude-install-search-engine "github"     "https://github.com/search?q="                 "Search GitHub: ")
  (prelude-install-search-engine "duckduckgo" "https://duckduckgo.com/?t=lm&q="              "Search DuckDuckGo: ")
  (prelude-install-search-engine "angular"     "https://www.google.com/search?as_sitesearch=angularjs.org&as_q=" "AngularJS: ")

#+end_src

