config.el

(setq ido-default-buffer-method 'selected-window)

;; eshell prompt color
    (setq eshell-prompt-function (lambda nil
                                   (concat
                                    (propertize (eshell/pwd) 'face `(:foreground "cyan"))
                                    (propertize " $" 'face `(:foreground "cyan"))
                                    (propertize " " 'face `(:foreground "white"))
                                    )))
    (setq eshell-highlight-prompt nil)

    ;; Create a new eshell with prompt
    (defun db-create-eshell ()
      "creates a shell with a given name"
      (interactive);; "Prompt\n eshell name:")
      (let ((eshell-name (read-string "eshell name: " nil)))
        (eshell (concat "Eshell/" eshell-name ))))

    (defun db-create-shell ()
      "creates a shell with a given name"
      (interactive);; "Prompt\n shell name:")
      (let ((shell-name (read-string "shell name: " nil)))
        (shell (concat "Shell/" shell-name))))

(defun db-execute-last-eshell-command ()
  (interactive)
  (let ((eshell-buffer "*eshell*"))
    (if (get-buffer eshell-buffer)
        (with-current-buffer eshell-buffer
          (eshell-previous-input 1)
          (eshell-send-input))
      (message (concat "Eshell buffer " eshell-buffer " not found")))))
(bind-key "C-c e" 'db-execute-last-eshell-command)

(bind-key "<f7>" 'kmacro-start-macro-or-insert-counter)
(bind-key "<f8>" 'kmacro-end-or-call-macro)
(bind-key "S-<f8>" 'apply-macro-to-region-lines)

(bind-key "C-h a" 'apropos)

(bind-key "M-n"     'forward-paragraph)
(bind-key "M-p"     'backward-paragraph)

(bind-key "C-c n"   'winner-redo)
(bind-key "C-c p"   'winner-undo)

(bind-key "C-x C-1" 'delete-other-windows)
(bind-key "C-x C-2" 'split-window-below)
(bind-key "C-x C-3" 'split-window-right)
(bind-key "C-x C-0" 'delete-window)

(bind-key "C-;" 'repeat)

(bind-key "s-n" 'narrow-or-widen-dwim)

;; Font size
(bind-key "C-0" '(lambda ()  (interactive) (text-scale-set 0)))
(bind-key "C-+" 'text-scale-increase)
(bind-key "C-=" 'text-scale-increase)
(bind-key "C--" 'text-scale-decrease)
(bind-key "C-<kb-0>" '(lambda ()  (interactive) (text-scale-set 0)))
(bind-key "C-<kp-add>" 'text-scale-increase)
(bind-key "C-<kp-subtract>" 'text-scale-decrease)

;; A la carte Menu
(bind-key "C-x c" 'lacarte-execute-menu-command)

;; helm-imenuu
;; (bind-key "C-t" 'transpose-chars)
;; (bind-key "M-t" 'transpose-words)
;; (bind-key "C-t" 'idomenu)
;; (bind-key "M-t" 'imenu-anywhere)

;; Locked mode
(bind-key "C-c C-l" 'locked-buffer-mode)

;; Windows manipulation
(bind-key "C-x |"           'split-window-right)
(bind-key "C-x -"           'split-window-below)
(bind-key "C-x C-<right>"   'windmove-right)
(bind-key "C-x C-<left>"    'windmove-left)
(bind-key "C-x C-<down>"    'windmove-down)
(bind-key "C-x C-<up>"      'windmove-up)

; (bind-key "C-x C-l"   'windmove-right)
; (bind-key "C-x C-j"    'windmove-left)
; (bind-key "C-x C-<down>"    'windmove-down)
; (bind-key "C-x C-<up>"      'windmove-up)

(bind-key "C-x <left>"      'shrink-window-horizontally)
(bind-key "C-x <right>"     'enlarge-window-horizontally)
(bind-key "C-x <up>"        'enlarge-window)
(bind-key "C-x <down>"      'shrink-window)

;; (bind-key "M-<right>" 'other-window)
;; (bind-key "M-<left>" '(lambda (&optional n)
;;                                           (interactive "P") (other-window -1)))

(bind-key "C-<prior>" 'beginning-of-buffer)
(bind-key "C-<next>" 'end-of-buffer)
(bind-key "<prior>" 'scroll-down-command)
(bind-key "<next>" 'scroll-up-command)
(bind-key "M-<down>" (lambda () (interactive) (scroll-down -4)))
(bind-key "M-<up>" (lambda () (interactive) (scroll-down 4)))


;; Undo Tree mode
;; (bind-key "C-+" 'undo-tree-redo)

;; iy-go-to-char
(bind-key* "C-M-<right>" 'iy-go-to-char)
(bind-key* "C-M-<left>" 'iy-go-to-char-backward)

;; multiple-cursors bindings
(bind-key "s-M" 'mc/edit-lines)
(bind-key "s-." 'mc/mark-next-like-this)
(bind-key "s-," 'mc/mark-previous-like-this)
(bind-key "s->" 'mc/unmark-next-like-this)
(bind-key "s-<" 'mc/unmark-previous-like-this)
(bind-key "s-m" 'mc/mark-all-like-this)

(bind-key "<C-down-mouse-1>" 'mc/add-cursor-on-click)


;; Expand region by semantics units
(bind-key "s-\/" 'er/expand-region)
(bind-key "s-?" 'er/contract-region)

;; Register Windows
(bind-key "<f9>" '(lambda () (interactive) (jump-to-register 9)
                                (message "Windows disposition loaded")))
(bind-key "<f10>" '(lambda () (interactive) (window-configuration-to-register 9)
                                 (message "Windows disposition saved")))

;; Projectile
(bind-key "C-M-d" 'projectile-find-dir)


;; Resize Windows
(bind-key "C-M-<left>" 'shrink-window-horizontally)
(bind-key "C-M-<right>" 'enlarge-window-horizontally)
(bind-key "C-M-<down>" 'shrink-window)
(bind-key "C-M-<up>" 'enlarge-window)

(bind-key "<f11>" 'menu-bar-mode)
(bind-key "<f12>" 'indent-whole-buffer)


;; Ace Jump Mode
;; (define-key global-map (kbd "M-SPC") 'ace-jump-mode)
;; (define-key global-map (kbd "C-/") 'ace-jump-mode)

;;Project Explorer
;; (bind-key "<f1>" 'project-explorer-open)


;;Query Replace Regex
(bind-key "C-x C-r" 'query-replace-regexp)
(bind-key "s-O" 'my-projectile-multi-occur)

;; Macro bindings
;; (bind-key "<f2>" 'apply-macro-to-region-lines)

;; Goto
(bind-key [(meta g)] 'goto-line)

(bind-key "C-x C-b" 'projectile-switch-to-buffer)

;; (bind-key "C-x b" 'ibuffer)
;; (bind-key "<M-up>" 'up-and-locate)
;; (bind-key "<M-down>" 'down-and-locate)
(bind-key [mouse-5] 'mouse-down-and-locate)
(bind-key [mouse-4] 'mouse-up-and-locate)

(defun set-frame-font-size (size)
  (interactive "nSize:")
  (set-face-attribute 'default (selected-frame) :height size)
  )

;; Show indentation
;; Nice scrolling
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)


(menu-bar-mode t)
(tool-bar-mode 0)

(which-function-mode t)
(blink-cursor-mode -1)

;; (global-linum-mode t)
(setq linum-format " %2d ")

(use-package spaceline-config
    :ensure spaceline
    :init
    (setq ns-use-srgb-colorspace nil)
    :config
    (spaceline-spacemacs-theme)
    (setq powerline-default-separator 'arrow)
;    (setq powerline-default-separator 'wave)
;    (setq powerline-height 20)
    (setq spaceline-workspace-numbers-unicode t)
    (setq spaceline-window-numbers-unicode t)
    )
