config.org
*** COMMENT Moe-dark
#+begin_src emacs-lisp :tangle yes
    (defun my-moe-light ()
      (interactive)
      (setq sml/theme 'light)
      (sml/setup)
      (setq moe-theme-mode-line-color 'cyan)
      (moe-light)
      )

    (defun my-moe-dark ()
      (interactive)
      (moe-dark)
      (setq sml/theme 'dark)
      (sml/setup)
      ;; (setq moe-theme-mode-line-color 'green)
      )

    ;; Theme customization
    (use-package moe-theme :ensure t)
    (require 'moe-theme)
    (my-moe-dark)
    ;; Available colors: blue, orange, magenta, yellow, purple, red, cyan, w/b.

    (set-face-attribute 'default nil :background nil)
    (set-face-attribute 'cursor nil :background "white")
    (set-face-attribute 'org-block-begin-line nil :background "#303030" :foreground "#999")
    (set-face-attribute 'org-block-end-line nil :inherit 'default :background "#303030" :foreground "#999")
    (set-face-attribute 'org-meta-line nil :inherit font-lock-comment-face)

  (after 'js2-mode
    (set-face-attribute 'js2-external-variable nil :foreground "orange red"))

#+end_src

*** COMMENT Tomorrow
#+begin_src emacs-lisp :tangle yes
(load-theme 'sanityinc-tomorrow-eighties t)
(setq default-frame-alist '((cursor-color . "#f2777a")))

(set-face-attribute 'org-level-1 nil :height 1.3)
(set-face-attribute 'org-level-2 nil :height 1.2)
(set-face-attribute 'org-level-3 nil :height 1.1 :foreground "#69C031")

(set-face-attribute 'org-level-3 nil  :foreground "#69C031")

#+end_src

*** COMMENT Atelier Dune Light
#+begin_src emacs-lisp :tangle yes
(load-theme 'base16-atelierdune-light t)
(load-theme 'smart-mode-line-light t)
; (load-theme 'base16-solarized-light t)
#+end_src

*** COMMENT Leuven
#+begin_src emacs-lisp :tangle yes
(load-theme 'leuven t)
#+end_src

*** Material
#+begin_src emacs-lisp :tangle yes
  (load-theme 'material)
#+end_src

*** COMMENT Solarized Light
#+begin_src emacs-lisp :tangle yes
(setq solarized-use-less-bold t)
(setq solarized-high-contrast-mode-line t)

  (load-theme 'solarized-light)
#+end_src

** COMMENT Font Lock speed (performance improvements with big files )
#+begin_src emacs-lisp :tangle yes
    ;;;;;;;;;;;;;;;;;;
    ;; Font lock speed
    ;;;;;;;;;;;;;;;;;;

    (setq font-lock-support-mode 'jit-lock-mode)
    (setq jit-lock-stealth-time
          16
          jit-lock-defer-contextually nil
          jit-lock-stealth-nice 0.5
          jit-lock-defer-time 0.05)

    (setq font-lock-maximum-decoration 0)
#+end_src

* Override
** OSX
#+begin_src emacs-lisp :tangle yes
  ;; key bindings
  (when (eq system-type 'darwin) ;; mac specific settings
    (setq mac-option-modifier 'super)
    (setq mac-right-option-modifier 'meta)
    (setq mac-command-modifier 'meta)
    (setq mac-right-command-modifier 'super))
#+end_src
** I don't even remember what's this
  #+begin_src emacs-lisp :tangle yes
    (add-hook
     'after-init-hook
     (lambda ()
       (after 'auto-complete
         (ac-set-trigger-key nil))
       ))

    (define-key  emacs-lisp-mode-map (kbd "C-M-x") nil)

    ;; (bind-key "C-f" 'forward-char)
    ;; (bind-key "C-b" 'backward-char)
    ;; (bind-key "C-j" 'newline-and-indent)

#+end_src
