config.el

(load-theme 'material)

(add-hook
 'after-init-hook
 (lambda ()
   (after 'auto-complete
     (ac-set-trigger-key nil))
   ))

(define-key  emacs-lisp-mode-map (kbd "C-M-x") nil)

;; (bind-key "C-f" 'forward-char)
;; (bind-key "C-b" 'backward-char)
;; (bind-key "C-j" 'newline-and-indent)
